//Операторы перехода (Справочник по C#) - содержит информацию  про управляющие операторы 
//Операторы итераций (справочник по C#) - содежрит информацию про конструкции циклов в си
//Цикл (программирование) - определение цикла
//Дейкстра,_Эдсгер_Вибе - ученый разработаваший концепцыю структурного програмирования
//Алгоритм_Дейкстры - алгоритм с помощю которого можна найти кротшайший путь к вершине графа
//Оператор безусловного перехода (goto) - описывает оператор goto и его  использование
//Цикломатическая сложность - количество  линейно зависимых дорог существующий в графе
//Значения метрик кода - оценочные критерии сложности кода 
